# SizingCalculationFlowOnlyWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..SizingCalculationFlowOnlyWarn Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SizingCalculationFlowOnlyWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SizingCalculationFlowOnlyWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SizingCalculationFlowOnlyWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace